{"pageProps":{"content":"New members must complete a series of tutorials teaching fundamental Python programming and data science skills, introducing the fundamental skills needed to participate in our projects.\n\nCheck back in at the beginning of the Fall 2023 semester for more information on completing tutorials. In the meantime, sign up to hear from us via our [interest form](https://forms.gle/B5TyHZHL44BcoKNX6), and read through our [FAQ](/join#FAQ).\n\n<hr/>\n\n# FAQ\n\n## Are there any requirements to join?\n\n**No!** We welcome all University of Michigan students, regardless of academic level or major.\n\n## How do I join?\n\nMDST takes new members at the beginning of each Fall/Winter semester. New members are required to complete a set of 2 tutorials giving an introduction to data science and programming in Python. While attendance at the tutorials is not mandatory, each tutorial will have an associated checkpoint which you must correctly complete and submit in order to join.\n\nAdditionally, these tutorials have an _optional_ challenge component which you can complete to share your skills in advanced data science concepts such as machine learning. Your performance on these challenge sections will be used to determine if you will be placed into more difficult projects.\n\n## I have no data science experience. Can I join?\n\n**Yes!** Everyone is welcome to join the team! Most of our members have very little data science experience prior to joining, and our goal is to help you learn the necessary skills to be a data scientists. We do strongly recommend newcomers attend our introductory tutorials, as they will teach you the basics of the tools we use and are also a great opportunity to meet others in the same boat!\n\n## How much time commitment do you require?\n\nMost MDST members spend 3 hours weekly for work sessions + 1 hour for socials on Thursday, totaling about 4 hours per week.\n\n## Does MDST allow for remote participation?\n\nMDST is a in-person club primarily, as all of our events and work sessions are held in-person on campus. We do allow remote participation for our projects, but we do not offer remote participation for our other events. We recommend attending our meetings in-person whenever possible to maximize your experience with the club.\n\n## What languages do you use?\n\nWe primarily use **Python**, but we sometimes work with other programming languages based on needs of specific projects. If you are an R user, we recommend checking out [this](https://www.google.com/url?q=https%3A%2F%2Fwww.datacamp.com%2Fcourses%2Fpython-for-r-users&sa=D&sntz=1&usg=AOvVaw0EGZ-9JrV1X0Kls2TJ_r7j) helpful tutorial on DataCamp.\n\n## I am not a student at the University of Michigan. Can I join?\n\nNo. Unfortunately, we are not currently accepting students outside U of M.\n","timeline":{"show_on_homepage":true,"title":"Recruiting Timeline","events":[{"title":"Festifall Central @ Booth D79","time":"August 30th 2:30pm - 5pm","description":"Stop by our booth to meet the E-Board and learn about MDST."},{"title":"Mass Meeting 1 (Location TBD)","time":"August 31th 7pm - 8pm","description":"Join us to hear more about MDST and how to become a member. Prospective members do not need to attend both mass meetings."},{"title":"Tutorial - Python (Location TBD)","time":"September 3rd 12pm - 3pm","description":"Develop essential Python skills for project participation."},{"title":"Mass Meeting 2 @ Michigan Union (Wolverine Room)","time":"September 4th 4:30pm - 5:30 pm","description":"Join us to hear more about MDST and how to become a member. Prospective members do not need to attend both mass meetings."},{"title":"Tutorial - Data Science (Location TBD)","time":"September 10th 12pm - 3pm","description":"Build basic data science knowledge for project participation."},{"title":"Project Exploration Fair (Location TBD)","time":"September 10th","description":"Explore MDST projects this semester and choose your favorites to signup for."},{"title":"Project Sign-Ups Due @ Google Form","time":"September 15th","description":"Sign up for your preferred projects. New members submit tutorial checkpoints."},{"title":"First Project Work Session @ BSB 1060","time":"September 17th 12pm - 3pm","description":"Meet your team and start work on your projects!"}]}},"__N_SSG":true}